In [4]:
import pandas as pd
import numpy as np

from sqlalchemy import create_engine, text
from getpass import getpass

pd.options.display.max_columns = None

In [306]:
df_completo = pd.read_csv("/home/miguel/Documents/Python/Empleados/data/empleados_limpio.csv", index_col = 0)

# Conexión con MySQL

In [204]:
# Almacenamos la contraseña en una variable de forma segura, para que nadie la pueda ver. 

password = getpass("Contraseña de MySQL: ")

In [205]:
# Almacenamos el nombre de nuestra BBDD en una variable
db_name = "empleados"

# Creamos la conexipn con MySQL
url = f"mysql+pymysql://root:{password}@localhost/{db_name}"

In [206]:
# Creamos el motor SQLAlchemy
engine = create_engine(url)
connection = engine.connect()

# Creación de tablas

Para transformar los datos del data frame en una base de datos relacional que cumpla con la primera, segunda y tercera forma normal, necesitamos identificar entidades, atributos y relaciones entre ellos. En este caso, podemos identificar las siguientes entidades:

    Employees
    Job Roles
    Education Fields

Estas declaraciones SQL crean tres tablas: Employees, JobRoles, and EducationFields. La tabla JobRoles iene una relación de clave externa con la tabla EducationFields. La tabla Employees contiene atributos relacionados con empleados individuales, y la tabla  JobRoles contiene información sobre JobRoles y sus EducationFields asociados.

from IPython.display import Image
Image("./images/bbdd_sql.png")

%%html
<img src="./images/bbdd_sql.png">

In [181]:
table_employees = text(f"""CREATE TABLE IF NOT EXISTS Employees (
    EmployeeID INT PRIMARY KEY,
    Age INT,
    Attrition VARCHAR(3),
    BusinessTravel VARCHAR(255),
    DistanceFromHome INT,
    Education INT,
    EnvironmentSatisfaction INT,
    Gender VARCHAR(1),
    JobInvolvement INT,
    JobLevel INT,
    JobRole VARCHAR(255),
    JobSatisfaction INT,
    MaritalStatus VARCHAR(255),
    MonthlyIncome FLOAT,
    MonthlyRate INT,
    NumCompaniesWorked INT,
    OverTime VARCHAR(3),
    PercentSalaryHike INT,
    PerformanceRating FLOAT,
    RelationshipSatisfaction INT,
    StockOptionLevel INT,
    TotalWorkingYears FLOAT,
    TrainingTimesLastYear INT,
    WorkLifeBalance FLOAT,
    YearsAtCompany INT,
    YearsSinceLastPromotion INT,
    YearsWithCurrManager INT,
    DateOfBirth INT,
    RemoteWork VARCHAR(3),
    FOREIGN KEY (JobRole) REFERENCES JobRoles(JobRole)
);
""")

table_education = text(f"""CREATE TABLE IF NOT EXISTS EducationFields (
    EducationField VARCHAR(255) PRIMARY KEY
);""")

table_jobroles = text(f"""CREATE TABLE IF NOT EXISTS JobRoles (
    JobRole VARCHAR(255) PRIMARY KEY,
    EducationField VARCHAR(255),
    FOREIGN KEY (EducationField) REFERENCES EducationFields(EducationField)
);
""")

# Ejecuto las queries para crear las tablas
with engine.connect() as connection:
    connection.execute(table_education)
    connection.execute(table_jobroles)
    connection.execute(table_employees)

# Insertar datos

Primero vamos a dividir el df en las tres tablas de nuestra bbdd.

In [185]:
df_completo.head()

,AGE,ATTRITION,BUSINESS_TRAVEL,DISTANCE_FROM_HOME,EDUCATION,EDUCATION_FIELD,ENVIRONMENT_SATISFACTION,GENDER,JOB_INVOLVEMENT,JOB_LEVEL,JOB_ROLE,JOB_SATISFACTION,MARITAL_STATUS,MONTHLY_INCOME,MONTHLY_RATE,NUM_COMPANIES_WORKED,OVER_TIME,PERCENT_SALARY_HIKE,PERFORMANCE_RATING,RELATIONSHIP_SATISFACTION,STOCK_OPTION_LEVEL,TOTAL_WORKING_YEARS,TRAINING_TIMES_LAST_YEAR,WORK_LIFE_BALANCE,YEARS_AT_COMPANY,YEARS_SINCE_LAST_PROMOTION,YEARS_WITH_CURR_MANAGER,DATE_BIRTH,REMOTE_WORK
0,51,No,NaN,6,3,NaN,1,F,3,5,research_director,3,NaN,19537.0,6462,7,No,13,3.0,3,0,NaN,5,3.0,20,15,15,1972,yes
1,52,No,NaN,1,4,life_sciences,3,F,2,5,manager,3,NaN,19999.0,5678,0,NaN,14,3.0,1,1,34.0,5,3.0,33,11,9,1971,yes
2,42,No,travel_rarely,4,2,technical_degree,3,F,3,5,manager,4,married,19232.0,4933,1,No,11,3.0,4,0,22.0,3,NaN,22,11,15,1981,yes
3,47,No,travel_rarely,2,4,medical,1,M,3,4,research_director,3,married,17169.0,26703,3,NaN,19,3.0,2,2,NaN,2,NaN,20,5,6,1976,no
4,46,No,NaN,3,3,technical_degree,1,M,4,4,sales_executive,1,divorced,15341.0,7739,2,No,12,3.0,4,1,NaN,5,3.0,19,2,8,1977,no

In [302]:
df_table_education = df_completo[['EDUCATION_FIELD']]

In [ ]:
# No quiero perder sus nulos, pero no pueden quedar como tal, de forma que lo sustituimos por un string
df_table_education.fillna('NULL', inplace=True)

In [303]:
df_table_jobroles = df_completo[['JOB_ROLE', 'EDUCATION_FIELD']]

In [314]:
# No quiero perder sus nulos, pero no pueden quedar como tal, de forma que lo sustituimos por un string
df_table_jobroles.fillna('NULL', inplace=True)

In [304]:
df_table_employees = df_completo .drop(['EDUCATION_FIELD'], axis=1)

In [315]:
# No quiero perder sus nulos, pero no pueden quedar como tal, de forma que lo cambiamos a None, que sí es un formato admitido por SQL
df_table_employees.replace(np.nan, None, inplace=True)

In [316]:
# Añadimos una columna ID que sirva para identificar a los empleados
df_table_employees.insert(0, 'ID', range(0,len(df_table_employees)))

### Ingesta de la tabla EducationFields

In [313]:
%%capture

for index, row in df_table_education.iterrows():

    education_field = row['EDUCATION_FIELD']

    query = text("SELECT EducationField FROM EducationFields WHERE EducationField = :education_field")

    result = connection.execute(query, {"education_field": education_field}).fetchall()

    # Verificar si el registro ya existe
    if result:
        print(f"Educational field '{education_field}' already exists.")
    else:
        # Si el registro no existe, ingresarlo en la tabla  'EducationFields'
        insert_query = text("INSERT INTO EducationFields (EducationField) VALUES (:education_field)")
        connection.execute(insert_query, {"education_field": education_field})
        print(f"Educational field '{education_field}' inserted successfully.")

### Ingesta de la tabla JobRoles

In [258]:
%%capture

for index, row in df_table_jobroles.iterrows():

    job_role = row['JOB_ROLE']
    education_field = row['EDUCATION_FIELD']

    # Verificar si el registro ya existe en la tabla 'EducationFields'
    query_education = text("SELECT EducationField FROM EducationFields WHERE EducationField = :education_field")
    result_education = connection.execute(query_education, {"education_field": education_field}).fetchall()

    # Verificar si el registro ya existe en la tabla 'JobRoles'
    query_jobrole = text("SELECT JobRole FROM JobRoles WHERE JobRole = :job_role")
    result_jobrole = connection.execute(query_jobrole, {"job_role": job_role}).fetchall()

    # Si el registro no existe, ingresarlo en la tabla 'EducationFields'
    if not result_education:
        insert_education_query = text("INSERT INTO EducationFields (EducationField) VALUES (:education_field)")
        connection.execute(insert_education_query, {"education_field": education_field})
        print(f"Educational field '{education_field}' inserted successfully.")

    # Si el registro no existe, ingresarlo en la tabla 'JobRoles'
    if not result_jobrole:
        insert_jobrole_query = text("INSERT INTO JobRoles (JobRole, EducationField) VALUES (:job_role, :education_field)")
        connection.execute(insert_jobrole_query, {"job_role": job_role, "education_field": education_field})
        print(f"Job role '{job_role}' inserted successfully.")
    else:
        print(f"Job role '{job_role}' already exists.")

### Ingesta de la tabla Employees

In [300]:
%%capture

for index, row in df_table_employees.iterrows():

    employee_id = row['ID']
    age = row['AGE']
    attrition = row['ATTRITION']
    business_travel = row['BUSINESS_TRAVEL']
    distance_from_home = row['DISTANCE_FROM_HOME']
    education = row['EDUCATION']
    environment_satisfaction = row['ENVIRONMENT_SATISFACTION']
    gender = row['GENDER']
    job_involvement = row['JOB_INVOLVEMENT']
    job_level = row['JOB_LEVEL']
    job_role = row['JOB_ROLE']
    job_satisfaction = row['JOB_SATISFACTION']
    marital_status = row['MARITAL_STATUS']
    monthly_income = row['MONTHLY_INCOME']
    monthly_rate = row['MONTHLY_RATE']
    num_companies_worked = row['NUM_COMPANIES_WORKED']
    over_time = row['OVER_TIME']
    percent_salary_hike = row['PERCENT_SALARY_HIKE']
    performance_rating = row['PERFORMANCE_RATING']
    relationship_satisfaction = row['RELATIONSHIP_SATISFACTION']
    stock_option_level = row['STOCK_OPTION_LEVEL']
    total_working_years = row['TOTAL_WORKING_YEARS']
    training_times_last_year = row['TRAINING_TIMES_LAST_YEAR']
    work_life_balance = row['WORK_LIFE_BALANCE']
    years_at_company = row['YEARS_AT_COMPANY']
    years_since_last_promotion = row['YEARS_SINCE_LAST_PROMOTION']
    years_with_curr_manager = row['YEARS_WITH_CURR_MANAGER']
    date_of_birth = row['DATE_BIRTH']
    remote_work = row['REMOTE_WORK']

    # Verificar si el registro ya existe en la tabla 'Employees'
    query_employee = text("SELECT EmployeeID FROM Employees WHERE EmployeeID = :employee_id")
    result_employee = connection.execute(query_employee, {"employee_id": employee_id}).fetchall()

    # Si el registro no existe, ingresarlo en la tabla 'Employees'
    if not result_employee:
        insert_employee_query = text("""
            INSERT INTO Employees (
                EmployeeID, Age, Attrition, BusinessTravel, DistanceFromHome, Education,
                EnvironmentSatisfaction, Gender, JobInvolvement, JobLevel, JobRole,
                JobSatisfaction, MaritalStatus, MonthlyIncome, MonthlyRate,
                NumCompaniesWorked, OverTime, PercentSalaryHike, PerformanceRating,
                RelationshipSatisfaction, StockOptionLevel, TotalWorkingYears,
                TrainingTimesLastYear, WorkLifeBalance, YearsAtCompany,
                YearsSinceLastPromotion, YearsWithCurrManager, DateOfBirth, RemoteWork
            )
            VALUES (
                :employee_id, :age, :attrition, :business_travel, :distance_from_home,
                :education, :environment_satisfaction, :gender, :job_involvement,
                :job_level, :job_role, :job_satisfaction, :marital_status,
                :monthly_income, :monthly_rate, :num_companies_worked, :over_time,
                :percent_salary_hike, :performance_rating, :relationship_satisfaction,
                :stock_option_level, :total_working_years, :training_times_last_year,
                :work_life_balance, :years_at_company, :years_since_last_promotion,
                :years_with_curr_manager, :date_of_birth, :remote_work
            )
        """)
        connection.execute(insert_employee_query, {
            "employee_id": employee_id,
            "age": age,
            "attrition": attrition,
            "business_travel": business_travel,
            "distance_from_home": distance_from_home,
            "education": education,
            "environment_satisfaction": environment_satisfaction,
            "gender": gender,
            "job_involvement": job_involvement,
            "job_level": job_level,
            "job_role": job_role,
            "job_satisfaction": job_satisfaction,
            "marital_status": marital_status,
            "monthly_income": monthly_income,
            "monthly_rate": monthly_rate,
            "num_companies_worked": num_companies_worked,
            "over_time": over_time,
            "percent_salary_hike": percent_salary_hike,
            "performance_rating": performance_rating,
            "relationship_satisfaction": relationship_satisfaction,
            "stock_option_level": stock_option_level,
            "total_working_years": total_working_years,
            "training_times_last_year": training_times_last_year,
            "work_life_balance": work_life_balance,
            "years_at_company": years_at_company,
            "years_since_last_promotion": years_since_last_promotion,
            "years_with_curr_manager": years_with_curr_manager,
            "date_of_birth": date_of_birth,
            "remote_work": remote_work
        })
        print(f"Employee with ID '{employee_id}' inserted successfully.")
    else:
        print(f"Employee with ID '{employee_id}' already exists.")